; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
)
(:goal (and
	(have_image Phenomenon7 spectrograph2)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph2)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 thermograph0)
	(have_image Planet15 spectrograph2)
	(have_image Phenomenon16 spectrograph1)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 spectrograph2)
))

)

; plan
1. (turn_to satellite0 star6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star6)
   goals met: 0 of 12
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 12
3. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 0 of 12
4. (turn_to satellite0 phenomenon17 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 12
5. (take_image satellite0 phenomenon17 instrument0 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 1 of 12
6. (turn_to satellite0 phenomenon16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 12
7. (take_image satellite0 phenomenon16 instrument0 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon14 instrument0 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 3 of 12
10. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 12
11. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 12
13. (take_image satellite0 phenomenon10 instrument0 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 5 of 12
14. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 12
15. (take_image satellite0 phenomenon7 instrument0 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 6 of 12
16. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 6 of 12
17. (take_image satellite0 planet11 instrument0 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 7 of 12
18. (turn_to satellite0 planet15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet15)
   goals met: 7 of 12
19. (take_image satellite0 planet15 instrument0 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 8 of 12
20. (turn_to satellite0 planet18 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet18)
   goals met: 8 of 12
21. (take_image satellite0 planet18 instrument0 spectrograph2)
   added: (have_image planet18 spectrograph2)
   goals met: 9 of 12
22. (turn_to satellite0 planet8 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet8)
   goals met: 9 of 12
23. (take_image satellite0 planet8 instrument0 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 10 of 12
24. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 10 of 12
25. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 11 of 12
26. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 11 of 12
27. (take_image satellite0 star9 instrument0 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 12 of 12
